---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotJoinRoofError
source: html/9f5a54b2-59d4-d3b4-3b84-90a093e9f944.htm
---
# Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotJoinRoofError Property

The roof cannot be joined.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotJoinRoofError { get; }
```